       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD-COBOL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       
       INPUT-OUTPUT SECTION.
       
       DATA DIVISION.
       
       FILE SECTION.
       
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "HELLO WORLD".
           
           
           
           
           STOP RUN.
           
           END PROGRAM HELLO-WORLD-COBOL.
           
      
     
